# condition selection

In [1]:
import numpy as np 
import pandas as pd

In [2]:

data = {
    'EMP_id': range(1, 21),

    'Name': [
        'kaushik','kanji','ram','raj','janvi','dharuvi','kinjal','diya',
        'darshna','sneha','komal','daxa','ajay','rakesh','jayesh',
        'shayam','ramesh','yogita','yash','yogesh'
    ],

    'Age': np.random.randint(20, 45, 20),

    'Department': [
        'IT','HR','ACCOUNT','FINANCE','IT','HR','IT','HR',
        'ACCOUNT','FINANCE','FINANCE','IT','HR','ACCOUNT',
        'FINANCE','IT','HR','ACCOUNT','FINANCE','IT'
    ],

    'Salary': np.random.randint(50000, 150000, 20),

    'City': [
        'Ahmedabad','Pune','Vadodara','Delhi','Jamnagar','Veraval',
        'Rajkot','Mumbai','Udaipur','Gandhinagar','Junagadh','Surat',
        'Vapi','Banaskantha','Jamnagar','Veraval','Rajkot','Mumbai',
        'Udaipur','Amreli'
    ]
}

df = pd.DataFrame(data)
print(df)

    EMP_id     Name  Age Department  Salary         City
0        1  kaushik   23         IT  100714    Ahmedabad
1        2    kanji   44         HR  113256         Pune
2        3      ram   25    ACCOUNT   60107     Vadodara
3        4      raj   35    FINANCE   61780        Delhi
4        5    janvi   31         IT   60530     Jamnagar
5        6  dharuvi   35         HR   70414      Veraval
6        7   kinjal   34         IT   88469       Rajkot
7        8     diya   34         HR  106965       Mumbai
8        9  darshna   24    ACCOUNT  113325      Udaipur
9       10    sneha   29    FINANCE   54611  Gandhinagar
10      11    komal   20    FINANCE   82125     Junagadh
11      12     daxa   34         IT  116676        Surat
12      13     ajay   38         HR   87469         Vapi
13      14   rakesh   34    ACCOUNT  148471  Banaskantha
14      15   jayesh   21    FINANCE   71752     Jamnagar
15      16   shayam   22         IT   78438      Veraval
16      17   ramesh   35         HR  112280       Rajkot
17      18   yogita   28    ACCOUNT   97590       Mumbai
18      19     yash   28    FINANCE   68289      Udaipur
19      20   yogesh   21         IT   58630       Amreli

In [3]:
# ðŸ‘‰ IT department ke saare employees select karo
df[df['Department'] == 'IT']

    EMP_id     Name  Age Department  Salary       City
0        1  kaushik   23         IT  100714  Ahmedabad
4        5    janvi   31         IT   60530   Jamnagar
6        7   kinjal   34         IT   88469     Rajkot
11      12     daxa   34         IT  116676      Surat
15      16   shayam   22         IT   78438    Veraval
19      20   yogesh   21         IT   58630     Amreli

In [4]:
# ðŸ‘‰ Select employees whose Age is greater than 30
df[df['Age'] > 30]

    EMP_id     Name  Age Department  Salary         City
1        2    kanji   44         HR  113256         Pune
3        4      raj   35    FINANCE   61780        Delhi
4        5    janvi   31         IT   60530     Jamnagar
5        6  dharuvi   35         HR   70414      Veraval
6        7   kinjal   34         IT   88469       Rajkot
7        8     diya   34         HR  106965       Mumbai
11      12     daxa   34         IT  116676        Surat
12      13     ajay   38         HR   87469         Vapi
13      14   rakesh   34    ACCOUNT  148471  Banaskantha
16      17   ramesh   35         HR  112280       Rajkot